import TextItem from "../TextItem"
import HorizontalLine from "../HorizontalLine"

function BFSInfo() {
    return (
        <>
            <TextItem>
                Алгоритм пошуку в ширину починається з довільної вершини і здійснює обхід усіх сусідніх вершин до переходу на наступну вершину.
                Алгоритм має назву пошуку в ширину, оскільки хвиля пошуку одноманітно розширюється вздовж усієї своєї ширини.
                Тобто, алгоритм проходить усі вершини на відстані k перед тим, як пройти вершини на відстані k+1.
            </TextItem>
            
            <TextItem><b>Гарантує найкоротший шлях.</b></TextItem>
            
            <HorizontalLine/>
            
            <TextItem>Покроковий опис алгоритму пошуку в ширину:</TextItem>
            <TextItem tabs={1}>{"1. Створити масив для зберігання відвіданих вершин"}</TextItem>
            <TextItem tabs={1}>{"1. Створити пусту чергу. Добавити в чергу початкову вершину"}</TextItem>
            <TextItem tabs={1}>{"2. Поки черга не пуста, повторювати кроки 3-9:"}</TextItem>
            <TextItem tabs={2}>{"3. Взяти з черги перший елемент та присвоїти його в змінну current"}</TextItem>
            <TextItem tabs={2}>{"4. Добавити current в список відвіданих вершин"}</TextItem>
            <TextItem tabs={2}>{"5. Якщо current це кінцева вершина - завершити виконання. Шлях знайдено"}</TextItem>
            <TextItem tabs={2}>{`6. Якщо current має невідвідану вершину зверху,
                то добавити її в кінець черги`
            }</TextItem>
            <TextItem tabs={2}>{`7. Якщо current має невідвідану вершину справа,
                то добавити її в кінець черги`
            }</TextItem>
            <TextItem tabs={2}>{`8. Якщо current має невідвідану вершину знизу,
                то добавити її в кінець черги`
            }</TextItem>
            <TextItem tabs={2}>{`9. Якщо current має невідвідану вершину зліва,
                то добавити її в кінець черги`
            }</TextItem>
            <TextItem tabs={1}>{`10. Алгоритм завершено, шляху немає`}</TextItem>
        </>
    );
}

export default BFSInfo;