import TextItem from "../TextItem"

function BinaryTreeAlgorithmInfo() {
    return (
        <>
            <TextItem>
                Повторює структуру бінарного дерева на лабіринті.
                На кожному кроці розглядається одна вершина, і випадковим чином вирішується де поставити блок: зверху чи зліва.
            </TextItem>
            <TextItem>
                Цей алгоритм будує ідеальний лабіринт. Це такий лабіринт, де між будь-якими двома точками є лише один шлях.
            </TextItem>
            <TextItem>
                Є одним з алгоритмів із можливістю генерувати ідеальний лабіринт без збереження будь-якого стану взагалі.
                Це дає змогу будувати лабіринти абсолютно будь-яких розмірів.
            </TextItem>
        </>
    );
}

export default BinaryTreeAlgorithmInfo;