import TextItem from "../TextItem"

function RecursiveDivisionInfo() {
    return (
        <>
            <TextItem>
                На кожному кроці поле випадковим чином ділиться пополам стіною з одним проходом.
                У такий спосіб створюються дві кімнати. Тепер викликається цей алгоритм для кожної з них.
            </TextItem>
            <TextItem>
                Цей алгоритм будує ідеальний лабіринт. Це такий лабіринт, де між будь-якими двома точками є лише один шлях.
            </TextItem>
            <TextItem>
                Є одним з алгоритмів із можливістю генерувати ідеальний лабіринт без збереження будь-якого стану взагалі.
                Це дає змогу будувати лабіринти абсолютно будь-яких розмірів.
            </TextItem>
        </>
    );
}

export default RecursiveDivisionInfo;