import TextItem from "../TextItem"

function RecursiveDivisionInfo() {
    return (
        <>
            <TextItem>
                На кожному кроці поле випадковим чином ділиться пополам стіною із одним проходом.
                Таким чином створюються дві кімнати. Тепер викликається даний алгоритм для кожної з них.
            </TextItem>
            <TextItem>
                Даний алгоритм будує ідеальний лабіринт. Це такий лабіринт, де між будь-якими двома точками існує лише один шлях.
            </TextItem>
            <TextItem>
                Є одним із алгоритмів із можливістю генерувати ідеальний лабіринт без збереження будь-якого стану взагалі.
                Це дозволяє будувати лабіринти абсолютно будь-яких розмірів.
            </TextItem>
        </>
    );
}

export default RecursiveDivisionInfo;