import TextItem from "../TextItem"
import HorizontalLine from "../HorizontalLine"

function MergeSortInfo() {
    return (
        <>
            <TextItem>
                Сортування злиттям (англ. Merge Sort) працює за принципом «розділяй та володарюй».
                На кожній ітерації відбувається злиття двох впорядкованих ділянок масиву в одну впорядковану ділянку іншого масиву.
            </TextItem>

            <TextItem><div>Складність алгоритму - O(n ∙ log(n)).</div></TextItem>
            
            <HorizontalLine/>

            <TextItem>Покроковий опис алгоритму сортування злиттям:</TextItem>
            <TextItem tabs={1}>{"1. Присвоїти l = 0; r = n-1"}</TextItem>
            <TextItem tabs={1}>{"2. Якщо l >= r, то завершити виконання алгоритму"}</TextItem>
            <TextItem tabs={1}>{"3. Присвоїти m = l+((r-l)/2)"}</TextItem>
            <TextItem tabs={1}>{"4. Рекурсивно виконати сортування лівої частини масиву: Розпочати цей алгоритм сортування з 2 кроку, прийнявши l = l; r = m"}</TextItem>
            <TextItem tabs={1}>{"5. Рекурсивно виконати сортування правої частини масиву: Розпочати цей алгоритм сортування з 2 кроку, прийнявши l = m+1; r = r"}</TextItem>
            <TextItem tabs={1}>{"6. Виконати процедуру злиття двох частин із даними l, m, r (На цьому кроці ліва і права частини алгоритму відсортовані)"}</TextItem>
            
            <HorizontalLine/>

            <TextItem>Покроковий опис алгоритму злиття двох частин масиву:</TextItem>
            <TextItem tabs={1}>{"1. Створити пустий тимчасовий масив - A_tmp"}</TextItem>
            <TextItem tabs={1}>{"2. Присвоїти i = 0 (індекс для підмасиву L); j = 0 (індекс для підмасиву R); n1 = m-l+1 (розмір масиву L); n2 = r-m (розмір масиву R)"}</TextItem>
            <TextItem tabs={1}>{"3. Поки (i < n1 && j < n2) повторювати крок 4"}</TextItem>
            <TextItem tabs={2}>
                4. Серед елементів A[l+i] (підмасив L з індексом i) та A[m+1+j] (підмасив R з індексом j) вибрати менший елемент та занести в масив A_tmp, 
                збільшити індекс вибраного елемента (i або j).
            </TextItem>
            <TextItem tabs={1}>{"5. У масив A_tmp занести елементи підмасиву L, що залишились"}</TextItem>
            <TextItem tabs={1}>{"6. У масив A_tmp занести елементи підмасиву R, що залишились"}</TextItem>
            <TextItem tabs={1}>{"7. Дані масиву A_tmp послідовно присвоїти основному масиву A, починаючи з індекса l"}</TextItem>

        </>
    );
}

export default MergeSortInfo;