import TextItem from "../TextItem"
import HorizontalLine from "../HorizontalLine"

function BoyerMooreInfo() {
    return (
        <>
            <TextItem>
                Ефективний алгоритм пошуку рядка, який є еталоном при практичних дослідженнях алгоритмів пошуку рядка.
                Зразок порівнюється з вихідним текстом 
                не у всіх позиціях — частина перевірок пропускаються як такі, що не дадуть результату. Це вимагає додаткових обчислень.
            </TextItem>
            <TextItem>
                Порівняння символів починається з кінця зразка, а не з початку.
            </TextItem>
            <TextItem>
                Попередньо проводиться дослідження зразка та для кожного його елементу визначається стоп-символ - 
                це символ у тексті, який є першим неспівпадінням тексту і зразка при порівнянні справа (з кінця зразка).
            </TextItem>
            <TextItem>Складність алгоритму - O(n/m), де n — довжина тексту, m — довжина зразка.</TextItem>

            <HorizontalLine/>

            <TextItem>Покроковий опис алгоритму пошуку Боєра - Мура (P - зразок, T - текст):</TextItem>
            <TextItem tabs={1}>1. Присвоїти i = 0 (індекс тексту); j = m-1 (індекс зразка)</TextItem>
            <TextItem tabs={1}>2. Порівнюємо P[j] та T[i+j]. Якщо збіг - перейти до кроку 3, інакше перейти до 5-го кроку</TextItem>
            <TextItem tabs={2}>{"3. Якщо j == 0, то алгоритм завершено, зразок знайдено"}</TextItem>
            <TextItem tabs={2}>{"4. Присвоїти j = j-1. Перейти до кроку 2"}</TextItem>
            <TextItem tabs={2}>{"5. Три можливі ситуації: "}</TextItem>
            <TextItem tabs={3}>{"6. Символа T[i+j] у зразку немає, тоді j = 0; i = i+m"}</TextItem>
            <TextItem tabs={3}>{"7. Крайня права позиція k входження символа T[i+j] у зразку < j, тоді j = 0; i = i+k-j"}</TextItem>
            <TextItem tabs={3}>{"8. Крайня права позиція k входження символа T[i+j] у зразку >= j, тоді j = 0; i = i+1"}</TextItem>
            <TextItem tabs={2}>{"5. Якщо i<=n-m, перейти до кроку 2, інакше алгоритм завершено, зразок не знайдено"}</TextItem>
            
        </>
    );

}

export default BoyerMooreInfo;

