import TextItem from "../TextItem"
import HorizontalLine from "../HorizontalLine"

function TournamentSortInfo() {
    return (
        <>
            <TextItem>Метод вибірки з дерева (англ. Tournament Sort).</TextItem>
            <TextItem>
                Послідовність чисел розбивається на пари, менший елемент пари виграє і просувається вперед.
                Таке просування відбувається доти, доки не залишиться один елемент. 
                Він буде найменшим з усіх. Поміщаємо його у відсортований список, та виконуємо описану процедуру заново, поки не буде вибрано всі елементи.
            </TextItem>

            <TextItem>
                У цій реалізації алгоритму його складність становить O(n<sup>2</sup>),
                і на практиці не застосовується. Основна причина такої складності - побудова нового дерева на кожному кроці.
                Є інший варіант такого сортування, який покращує цей алгоритм, і не перебудовує дерево на кожному кроці. Його складність - O(n ∙ log(n))
            </TextItem>

            <HorizontalLine/>
            
            <TextItem>Покроковий опис сортування методом вибірки з дерева:</TextItem>
            <TextItem tabs={1}>{"1. Повторювати кроки 2-3 при i=0,1,...,n-1"}</TextItem>
            <TextItem tabs={2}>{`2. Побудувати турнірне дерево із початкового масиву:
                усі елементи масиву поміщаються на останній рівень дерева;
                починаючи з останнього рівня відбувається проходження вверх, до кореня (на рівень вверх із двох синів проходить менший із них)
            `}</TextItem>
            <TextItem tabs={2}>{"3. Вибрати кореневу вершину, помістити її у відсортований масив, і видалити із початкового"}</TextItem>
        </>
    );
}

export default TournamentSortInfo;